Udemy/Yii/yii-rest/api/modules/v1/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        // foreach (self::$users as $user) {
        //     if ($user['accessToken'] === $token) {
        //         return new static($user);
        //     }
        // }

        // return null;
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `user` WHERE `access_token`='m_ZnQwHER4FKVo34EBsos8zwy9fIHObc'

    public static function findByUsername($username)
    {
        // return static::findOne(['username'=>$username,'status'=>self::ACTIVE_USER]);

        return static::find()->where(['username' => $username])
            ->orWhere(['email' => $username])
            ->andWhere(['status' => self::ACTIVE_USER])
            ->one();
---
SELECT * FROM `user` WHERE ((`username`='mayara@email.com') OR (`email`='mayara@email.com')) AND (`status`=1)