Udemy/Yii/yii-rest/api/modules/v1/models/UserSignup.php

    public function signup()
    {
        if(!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->access_token = \Yii::$app->security->generateRandomString(32);
        $user->unique_key = time() . mt_rand(10,99);
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return ($user->save()) ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `access_token`, `unique_key`, `password`, `auth_key`, `status`) VALUES ('teste', 'teste@gmail.com', 'RyRLiof5j3IJsMExrul3iIb63I4sg_cx', '167225060091', '$2y$13$SKszKFep/QWpjAyrhdtEAe9sOoZy8zsEFQrYIEKdSNebQ9E.nYxuW', '8-QlVf7I8Lcc3AETRc-RjDzpXbNb4qpO', 1)