Udemy/Yii/yii-rest/api/modules/v1/controllers/CategoryController.php

    public function actionIndex()
    {
        return Category::find()->all();
---
SELECT * FROM `category`

    public function actionCreate()
    {
        $model = new Category(['scenario' => 'newpost']);
        if ($model->load(\Yii::$app->request->post(), '')) {
            $model->title = \Yii::$app->request->post('title');
            $model->description = \Yii::$app->request->post('description');
            $model->save();
---
INSERT INTO `category` (`title`, `description`) VALUES ('Categoria 6', 'Descrição da categoria 6')

    public function actionRead($id)
    {
        $model = Category::find()->where(['id' => $id])->one();
---
SELECT * FROM `category` WHERE `id`='5'

    public function actionFaker()
    {
        $faker = \Faker\Factory::create();
        for($i = 1;$i<20;$i++) {
            $model = new Category(['scenario' => 'newpost']);
            $model->title = $faker->word;
            $model->description = $faker->text;
            $model->save();
---
INSERT INTO `category` (`title`, `description`) VALUES ('praesentium', 'Natus quisquam sed unde perspiciatis maiores provident. Nesciunt enim reprehenderit ex fugiat quo et et. Quod sunt sint quis atque. Cupiditate cumque illo tenetur velit fugiat omnis.')