Udemy/Yii/yii-rest/api/modules/v1/controllers/OauthController.php

SELECT * FROM `user` WHERE `username`='teste'
UPDATE `user` SET `access_token`='R833MZN9CA0k6TBvHJ2Dd37YzvjvQi1v' WHERE `id`=1
---
    public function actionLogin()
    {
        $model = new LoginForm();
        if($model->load(\Yii::$app->getRequest()->getBodyParams(), '') && $model->login()) {
            $user = User::findOne(['username'=>$model->username]);
            $user->access_token = \Yii::$app->security->generateRandomString();
            $user->save();