Udemy/Yii/yii-rest/api/modules/v1/controllers/PostsController.php

SELECT `title`, `body` FROM `posts`
---
    public function actionIndex()
    {
        return Posts::find()->select('title,body')->all();