Udemy/Yii/yii-rest/api/modules/v1/controllers/PostsController.php

    public function actionIndex()
    {
        return Posts::find()->select('title,body')->all();
---
SELECT `title`, `body` FROM `posts`